// щоб вивчити JS необхідно робити дз і = && бути присутнім на заняттях

true && false; //false
false && true; //false
true && true; // true
false && false; // false

// якщо не виконується хочі б одна умова то буде false
// щоб було true мають виконуватися всі умови

// я піду гуляти, якщо буде хороша погода або = || у  мене є парасолька
true || false; // true
false || true; // true
false || false; // false
true || true; //true
// має виконуватися хоча б одна умова

// що && = і  має завжди два true операнди щоб повернути true
// що || = або 
