// оголошення змінної

// розбір запису
// 1) ключове слово(let,const)
// 2) назва вашої змінної
// 3) = це є оператор присвоєння, який дозволяє присвоїти щось
// 4) "" це є значення нашого писвоєння
const hobby = "грати";
// змінні НЕ можуть повторюватися, тому що буде помилка


//перше слово з маленької, всі інші починаються з великої(правило записування змінної)
const veryLongNameHere = "";
// const - яку не можна змінювати або перевизначати в майбутньому 

let age ;
age = 20;
// let -  НЕ обов'язково давати значення одразу можна і в кінці коду дати значення
// ви можете змінювати його нижче у коді безліч разів

console.log(age);


// var asd = 2 ;
// це є старий стандарт




// типи данних
// існує 7 примітивних типів: 
// це є рядок
const string = "dsfgdfhrydfvc";
console.log(typeof string);
// це є число
const number = 20;
// const number = "20" + 80;
// const number = 40 + 50 + false + "20" + 80;
// false = 0
// true = 1
// конкатенація - зшивання строк
console.log(typeof number);

// true = правда 
// false = не правда
const boolean = true || false;
console.log(typeof boolean);

// за рахунок цього, можна повідомити користувача через модальне вікно, яке вспливає
// alert("Все пропало, все погано, все упало");

const message = confirm ("Чи згодні ви ?");
console.log(message);

const asds = prompt("Введіть ім'я");
console.log(asds);