// Цикли
// while(лічильник, авторизація)

let i = 0;
// if дуже схожий на while
// while - ключове слово для створення циклу
// ( - умова для виконання циклу), коли ця умова перестане виконуватия то цикл теж перестане виконуватися
// поки умова виконується буде виконуватися той код що у вас записаний у фігурних дужках
// {} - тіло циклу
while (i <= 10) {
  // i = i + 1;
  // i += 1;
  i++;
  console.log(i);
}
// виконується поки умова true, якщо умова приводиться до false то не виконується жодного разу
let auth = false;
while (!auth) {
  const password = prompt("Введи пароль");
  if (password === "123456") {
    auth = true;
    alert("Вітаємо Вас у системі");
  } else {
    alert("Спробуй ще");
  }
}

//  do whyle
// while - спочатку перевіряє, а потім робе
// do whyle - спочатку зроби, а потім подумай

// Redirect
let ok = false;

do{
  ok = confirm("Чи згодні ви, що вас редіректне на іншу сторінку для переглядів бажаного контенту?");
   if (true) {
     // таким чином можемо редірект на іншу сторінку
     console.log((window.location.href = "https://google.com/"));
   }
} while (!ok);

